연산자 오버로딩 불가능 List

.					멤버 접근 연산자
.*					멤버 포인터 연산자
::					범위 지정 연산자
?:					조건 연산자(3항)
sizeof				바이트 단위 크기 계산
typeid				RTTI 관련 연산자
static_cast			형변환 연산자
dynamic_cast		형변환 연산자
const_cast			형변환 연산자
reinterpret_cast	형변환 연산자

∵ C++의 문법규칙 보존

///////////////////

멤버 함수 기반으로만 오버로딩 가능

=		대입 연산자
()		함수 호출 연산자
[]		배열 접근 연산자(인덱스)
->		멤버 접근을 위한 포인터 연산자

#객체를 대상으로 진행해야 의미가 있으므로 멤버함수 기반으로만 오버로딩 허용

//////////////////////

**주의사항

연산자 오버로딩을 하여도, 연산자가 지니는 우선순위와 결합성은 그대로 따름
매개변수의 디폴트값 설정이 불가능
연산자의 순수기능은 변경불가



